<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"41dec531f7d4c1351cfc2452b91e1dbbac7ba3ecab53fc2b0780de888d62b9bc","plan_job_ref":"Job Plan org changes and list them in a PR #15 at https://github.com/django-commons/membership/actions/runs/11465808160","plan_out_hash":"de5279cdddf8b69f013c8b04880baf29fa95dd1257ed5e6b56ca71ef1a0f0adb","plan_hash":"70e054f7aa023cd9e71fecef0cd762613f1b458f85e048198dc197313b3ed477","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform__
With var files: `terraform/production/org.tfvars
terraform/production/repositories.tfvars
`
With variables: `github_token = (sensitive value)`
<details>
<summary>Plan: 1 to import, 12 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # github_repository.this["drf-excel"] will be updated in-place
  # (imported from "drf-excel")
!~  resource "github_repository" "this" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = true
+       archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
!~      delete_branch_on_merge      = false -> true
        description                 = "An XLSX spreadsheet renderer for Django REST Framework."
        etag                        = "W/\"1070a531443ef65b68100a8006100d344f0e75964e9ee4b8480955009e6ca419\""
        full_name                   = "django-commons/drf-excel"
        git_clone_url               = "git://github.com/django-commons/drf-excel.git"
!~      has_discussions             = false -> true
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
!~      has_wiki                    = true -> false
        homepage_url                = null
        html_url                    = "https://github.com/django-commons/drf-excel"
        http_clone_url              = "https://github.com/django-commons/drf-excel.git"
        id                          = "drf-excel"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "drf-excel"
        node_id                     = "********************************"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 105686080
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:django-commons/drf-excel.git"
        svn_url                     = "https://github.com/django-commons/drf-excel"
        topics                      = []
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_environment.pypi["drf-excel"] will be created
+   resource "github_repository_environment" "pypi" {
+       can_admins_bypass   = true
+       environment         = "pypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "drf-excel"

+       reviewers {
+           teams = (known after apply)
        }
    }

  # github_repository_environment.testpypi["drf-excel"] will be created
+   resource "github_repository_environment" "testpypi" {
+       can_admins_bypass   = true
+       environment         = "testpypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "drf-excel"
    }

  # github_team.repo_admin_team["drf-excel"] will be created
+   resource "github_team" "repo_admin_team" {
+       create_default_maintainer = false
+       description               = "Admin team for the drf-excel repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "drf-excel-admins"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_committer_team["drf-excel"] will be created
+   resource "github_team" "repo_committer_team" {
+       create_default_maintainer = false
+       description               = "Committers team for the drf-excel repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "drf-excel-committers"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_team["drf-excel"] will be created
+   resource "github_team" "repo_team" {
+       create_default_maintainer = false
+       description               = "Main team for the drf-excel repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "drf-excel"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team_members.repo_admin_members["drf-excel"] will be created
+   resource "github_team_members" "repo_admin_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "FlipperPA"
        }
+       members {
+           role     = "member"
+           username = "browniebroke"
        }
    }

  # github_team_members.repo_committer_team_members["drf-excel"] will be created
+   resource "github_team_members" "repo_committer_team_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "rptmat57"
        }
    }

  # github_team_members.repo_team_members["drf-excel"] will be created
+   resource "github_team_members" "repo_team_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "FlipperPA"
        }
+       members {
+           role     = "member"
+           username = "browniebroke"
        }
+       members {
+           role     = "member"
+           username = "rptmat57"
        }
    }

  # github_team_repository.repo_admin_team_access["drf-excel"] will be created
+   resource "github_team_repository" "repo_admin_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "admin"
+       repository = "drf-excel"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_committer_team_access["drf-excel"] will be created
+   resource "github_team_repository" "repo_committer_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "maintain"
+       repository = "drf-excel"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_team_access["drf-excel"] will be created
+   resource "github_team_repository" "repo_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "triage"
+       repository = "drf-excel"
+       team_id    = (known after apply)
    }

  # github_team_settings.this["drf-excel"] will be created
+   resource "github_team_settings" "this" {
+       id        = (known after apply)
+       team_id   = (known after apply)
+       team_slug = (known after apply)
+       team_uid  = (known after apply)

+       review_request_delegation {
+           algorithm    = "LOAD_BALANCE"
+           member_count = 2
+           notify       = false
        }
    }

Plan: 1 to import, 12 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan org changes and list them in a PR #15](https://github.com/django-commons/membership/actions/runs/11465808160)